rorke-time/sriov_rorke_time/rorke800-memtier-50k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         4545.44          ---          ---         1.33444         1.48700         3.26300         5.85500       305.77 
Gets        45447.50     18153.29     27294.21         1.33269         1.48700         3.35900         6.46300      2183.98 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      49992.94     18153.29     27294.21         1.33285         1.48700         3.35900         6.43100      2489.75 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.215        5.000
SET       0.295       10.000
SET       0.407       15.000
SET       0.727       20.000
SET       1.023       25.000
SET       1.191       30.000
SET       1.287       35.000
SET       1.367       40.000
SET       1.431       45.000
SET       1.487       50.000
SET       1.511       52.500
SET       1.527       55.000
SET       1.551       57.500
SET       1.567       60.000
SET       1.583       62.500
SET       1.599       65.000
SET       1.615       67.500
SET       1.623       70.000
SET       1.639       72.500
SET       1.655       75.000
SET       1.663       76.250
SET       1.671       77.500
SET       1.679       78.750
SET       1.687       80.000
SET       1.703       81.250
SET       1.711       82.500
SET       1.727       83.750
SET       1.735       85.000
SET       1.759       86.250
SET       1.775       87.500
SET       1.791       88.125
SET       1.807       88.750
SET       1.823       89.375
SET       1.847       90.000
SET       1.871       90.625
SET       1.911       91.250
SET       1.959       91.875
SET       2.007       92.500
SET       2.063       93.125
SET       2.127       93.750
SET       2.159       94.062
SET       2.175       94.375
SET       2.207       94.688
SET       2.239       95.000
SET       2.271       95.312
SET       2.303       95.625
SET       2.335       95.938
SET       2.383       96.250
SET       2.415       96.562
SET       2.463       96.875
SET       2.495       97.031
SET       2.527       97.188
SET       2.559       97.344
SET       2.591       97.500
SET       2.623       97.656
SET       2.671       97.812
SET       2.735       97.969
SET       2.815       98.125
SET       2.895       98.281
SET       2.975       98.438
SET       3.007       98.516
SET       3.055       98.594
SET       3.087       98.672
SET       3.119       98.750
SET       3.167       98.828
SET       3.215       98.906
SET       3.263       98.984
SET       3.327       99.062
SET       3.423       99.141
SET       3.567       99.219
SET       3.647       99.258
SET       3.727       99.297
SET       3.839       99.336
SET       3.935       99.375
SET       4.047       99.414
SET       4.159       99.453
SET       4.319       99.492
SET       4.415       99.531
SET       4.575       99.570
SET       4.671       99.609
SET       4.735       99.629
SET       4.767       99.648
SET       4.799       99.668
SET       4.831       99.688
SET       4.895       99.707
SET       4.959       99.727
SET       4.991       99.746
SET       5.119       99.766
SET       5.215       99.785
SET       5.311       99.805
SET       5.375       99.814
SET       5.439       99.824
SET       5.471       99.834
SET       5.535       99.844
SET       5.599       99.854
SET       5.663       99.863
SET       5.695       99.873
SET       5.759       99.883
SET       5.791       99.893
SET       5.887       99.902
SET       5.887       99.907
SET       5.919       99.912
SET       5.951       99.917
SET       6.047       99.922
SET       6.111       99.927
SET       6.207       99.932
SET       6.271       99.937
SET       6.335       99.941
SET       6.399       99.946
SET       6.527       99.951
SET       6.559       99.954
SET       6.623       99.956
SET       6.655       99.958
SET       6.719       99.961
SET       6.879       99.963
SET       6.975       99.966
SET       7.103       99.968
SET       7.263       99.971
SET       7.423       99.973
SET       7.679       99.976
SET       7.839       99.977
SET       7.999       99.978
SET       8.159       99.979
SET       8.319       99.980
SET       8.639       99.982
SET       8.767       99.983
SET       8.959       99.984
SET       9.151       99.985
SET       9.215       99.987
SET       9.407       99.988
SET       9.471       99.988
SET       9.535       99.989
SET       9.535       99.990
SET       9.599       99.990
SET       9.855       99.991
SET       9.855       99.991
SET       9.919       99.992
SET       9.983       99.993
SET       9.983       99.993
SET      10.303       99.994
SET      10.367       99.994
SET      10.367       99.995
SET      10.367       99.995
SET      10.431       99.995
SET      10.431       99.995
SET      10.751       99.996
SET      10.751       99.996
SET      10.751       99.996
SET      10.751       99.997
SET      10.751       99.997
SET      10.815       99.997
SET      10.815       99.997
SET      10.815       99.997
SET      10.815       99.998
SET      10.815       99.998
SET      11.135       99.998
SET      11.135       99.998
SET      11.135       99.998
[...]
SET      11.199       99.999
SET      11.199       99.999
SET      11.199       99.999
[...]
SET      11.647       99.999
SET      11.647      100.000
---
GET       0.047        0.000
GET       0.207        5.000
GET       0.287       10.000
GET       0.399       15.000
GET       0.711       20.000
GET       1.023       25.000
GET       1.183       30.000
GET       1.287       35.000
GET       1.367       40.000
GET       1.431       45.000
GET       1.487       50.000
GET       1.511       52.500
GET       1.527       55.000
GET       1.551       57.500
GET       1.567       60.000
GET       1.583       62.500
GET       1.599       65.000
GET       1.607       67.500
GET       1.623       70.000
GET       1.639       72.500
GET       1.655       75.000
GET       1.663       76.250
GET       1.671       77.500
GET       1.679       78.750
GET       1.687       80.000
GET       1.695       81.250
GET       1.711       82.500
GET       1.719       83.750
GET       1.735       85.000
GET       1.751       86.250
GET       1.767       87.500
GET       1.783       88.125
GET       1.791       88.750
GET       1.807       89.375
GET       1.831       90.000
GET       1.855       90.625
GET       1.887       91.250
GET       1.927       91.875
GET       1.975       92.500
GET       2.039       93.125
GET       2.095       93.750
GET       2.127       94.062
GET       2.159       94.375
GET       2.191       94.688
GET       2.223       95.000
GET       2.239       95.312
GET       2.271       95.625
GET       2.303       95.938
GET       2.351       96.250
GET       2.383       96.562
GET       2.431       96.875
GET       2.463       97.031
GET       2.479       97.188
GET       2.511       97.344
GET       2.559       97.500
GET       2.591       97.656
GET       2.639       97.812
GET       2.719       97.969
GET       2.799       98.125
GET       2.895       98.281
GET       3.007       98.438
GET       3.055       98.516
GET       3.103       98.594
GET       3.151       98.672
GET       3.199       98.750
GET       3.247       98.828
GET       3.295       98.906
GET       3.343       98.984
GET       3.423       99.062
GET       3.567       99.141
GET       3.743       99.219
GET       3.823       99.258
GET       3.903       99.297
GET       3.983       99.336
GET       4.063       99.375
GET       4.159       99.414
GET       4.319       99.453
GET       4.447       99.492
GET       4.575       99.531
GET       4.703       99.570
GET       4.799       99.609
GET       4.863       99.629
GET       4.927       99.648
GET       4.991       99.668
GET       5.055       99.688
GET       5.151       99.707
GET       5.247       99.727
GET       5.375       99.746
GET       5.471       99.766
GET       5.567       99.785
GET       5.663       99.805
GET       5.727       99.814
GET       5.759       99.824
GET       5.823       99.834
GET       5.887       99.844
GET       5.983       99.854
GET       6.079       99.863
GET       6.175       99.873
GET       6.271       99.883
GET       6.399       99.893
GET       6.495       99.902
GET       6.559       99.907
GET       6.623       99.912
GET       6.655       99.917
GET       6.751       99.922
GET       6.847       99.927
GET       6.975       99.932
GET       7.135       99.937
GET       7.327       99.941
GET       7.615       99.946
GET       7.935       99.951
GET       8.127       99.954
GET       8.319       99.956
GET       8.447       99.958
GET       8.639       99.961
GET       8.831       99.963
GET       8.959       99.966
GET       9.151       99.968
GET       9.407       99.971
GET       9.535       99.973
GET       9.791       99.976
GET       9.855       99.977
GET       9.919       99.978
GET      10.047       99.979
GET      10.175       99.980
GET      10.303       99.982
GET      10.367       99.983
GET      10.431       99.984
GET      10.559       99.985
GET      10.687       99.987
GET      10.815       99.988
GET      10.815       99.988
GET      10.879       99.989
GET      10.943       99.990
GET      11.071       99.990
GET      11.135       99.991
GET      11.135       99.991
GET      11.199       99.992
GET      11.327       99.993
GET      11.327       99.993
GET      11.519       99.994
GET      11.519       99.994
GET      11.583       99.995
GET      11.647       99.995
GET      11.711       99.995
GET      11.711       99.995
GET      11.775       99.996
GET      11.839       99.996
GET      11.967       99.996
GET      12.095       99.997
GET      12.159       99.997
GET      12.223       99.997
GET      12.287       99.997
GET      12.351       99.997
GET      12.415       99.998
GET      12.479       99.998
GET      12.671       99.998
GET      12.671       99.998
GET      13.119       99.998
GET      13.119       99.998
GET      14.079       99.998
GET      14.143       99.999
GET      15.039       99.999
GET      15.103       99.999
GET      15.999       99.999
GET      16.063       99.999
GET      17.023       99.999
GET      17.151       99.999
GET      17.919       99.999
GET      18.047       99.999
GET      18.943       99.999
GET      19.327       99.999
GET      19.327       99.999
GET      19.967       99.999
GET      19.967       99.999
GET      20.479       99.999
GET      20.479       99.999
GET      21.247      100.000
GET      21.247      100.000
GET      21.375      100.000
GET      21.375      100.000
GET      22.271      100.000
GET      22.271      100.000
GET      22.271      100.000
[...]
GET      22.399      100.000
GET      22.399      100.000
GET      22.399      100.000
[...]
GET      22.911      100.000
GET      22.911      100.000
GET      22.911      100.000
[...]
GET      23.295      100.000
GET      23.295      100.000
GET      23.295      100.000
[...]
GET      23.551      100.000
GET      23.551      100.000
---
WAIT      0.000      100.000